# <center>Laboratorium Analiza i bazy danych </center>

## <center>Łączenie tabel, podzapytania i funkcje agregujące</center>

## Przykładowe tabele obrazujące łączenie

Do zobrazowania operacji łączenia zostaną użyte tabele:

```sql
CREATE TABLE shape_a (
    id INT PRIMARY KEY,
    shape VARCHAR (100) NOT NULL
);
 
CREATE TABLE shape_b (
    id INT PRIMARY KEY,
    shape VARCHAR (100) NOT NULL
);
```
 
Polecenie CREATE TABLE tworzy tabelę o zadanej nazwie i strukturze. Ogólna postać to:
```sql
CREATE TABLE tab_name (
    col_name1 data_type constrain,
    col_name1 data_type constrain,
    ...
);
```
Należy uzupełnić ją danymi:
```sql
INSERT INTO shape_a (id, shape)
VALUES
    (1, 'Trójkąt'),
    (2, 'Kwadrat'),
    (3, 'Deltoid'),
    (4, 'Traper');
 
INSERT INTO shape_b (id, shape)
VALUES
    (1, 'Kwadrat'),
    (2, 'Trójkąt'),
    (3, 'Romb'),
    (4, 'Równoległobok');
```
Komenda INSERT INTO pozwala na dodanie do tabeli rekordów. Ogólna postać to:

```sql
INSERT INTO tab_name (col1_name, col2_name2, ...) 
VALUES
    (val1_col1, val2_col2),
    (val2_col1, val2_col2),
    ...
```

## Inner join 

Jest to podstawowy rodzaj złączenie. Ten sposób złączenia wybiera  te wiersze, dla których warunek złączenia jest spełniony. W żadnej z łączonych tabel kolumna użyta do łączenia nie może mieć wartości NULL. 

#### Przykład:
```sql
SELECT
    a.id id_a,
    a.shape shape_a,
    b.id id_b,
    b.shape shape_b
FROM
    shape_a a
INNER JOIN shape_b b ON a.shape = b.shape;
```
W zapytaniu powyżej użyto *aliasów* nazw tabel i column wynikowych, jest to szczególnie przydatne przy długich nazwach tabel i wprowadza czytelność w zapytaniu.

#### Wynik:
|id_a|shape_a|id_b|shape_b|
|-|-|-|-|
|1|Trójkąt|2|Trójkąt|
|2|Kwadrat|1|Kwadrat|

## OUTER JOIN

Istnieją trzy rodzaje złączeń OUTER:
- LEFT OUTER JOIN,
- RIGHT OUTER JOIN,
- FULL OUTER JOIN.

### LEFT OUTER JOIN

Ten rodzaj złączenie zwróci wszystkie rekordy z lewej tablicy i dopasuje do nich rekordy z prawej tablicy które spełniją zadany warunek złączenia. Jeżeli w prawej tablicy nie występują rekordy spełnijące warunek złączenia z lewą w ich miejscu pojawią się wartości NULL.

#### Przykład 1:
```sql
SELECT
    a.id id_a,
    a.shape shape_a,
    b.id id_b,
    b.shape shape_b
FROM
    shape_a a
LEFT JOIN shape_b b ON a.shape = b.shape;
```
#### Wynik:
|id_a|shape_a|id_b|shape_b|
|-|-|-|-|
|1|Trójkąt|2|Trójkąt|
|2|Kwadrat|1|Kwadrat|
|3|Deltoid|NULL|NULL|
|4|Traper|NULL|NULL|

#### Przykład 2:
```sql
SELECT
    b.id id_b,
    b.shape shape_b,
    a.id id_a,
    a.shape shape_a   
FROM
    shape_b b
LEFT JOIN shape_a a ON a.shape = b.shape;
```
#### Wynik:
|id_a|shape_a|id_b|shape_b|
|-|-|-|-|
|1|Kwadrat|2|Kwadrat|
|2|Trójkąt|1|Trójkąt|
|3|Romb|NULL|NULL|
|4|Równoległobok|NULL|NULL|

### RIGHT OUTER JOIN

Działa jak left outer join z tym, że prawa tablica w zapytaniu jest brana w całości.

#### Przykład:
```sql
SELECT
    a.id id_a,
    a.shape shape_a,
    b.id id_b,
    b.shape shape_b
FROM
    shape_a a
RIGHT JOIN shape_b b ON a.shape = b.shape;
```

#### Wynik:
|id_a|shape_a|id_b|shape_b|
|-|-|-|-|
|2|Kwadrat|1|Kwadrat|
|1|Trójkąt|2|Trójkąt|
|NULL|NULL|3|Romb|
|NULL|NULL|4|Równoległobok|


### FULL OUTER JOIN

Jest złączeniem które zwraca:
- wiersze dla których warunek złączenia jest spełniony,
- wiersze z lewej tabeli dla których nie ma odpowiedników w prawej,
- wiersze z prawej tabeli dla których nie ma odpowiedników w lewej. 

#### Przykład:
```sql
SELECT
    a.id id_a,
    a.shape shape_a,
    b.id id_b,
    b.shape shape_b
FROM
    shape_a a
FULL JOIN shape_b b ON a.shape = b.shape;
```
|id_a|shape_a|id_b|shape_b|
|-|-|-|-|
|1|Trójkąt|2|Trójkąt|
|2|Kwadrat|1|Kwadrat|
|3|Deltoid"|NULL|NULL|
|4|Traper|NULL|NULL|
|NULL|NULL|3|Romb|
|NULL|NULL|4|Równoległobok|

## Podzapytania

Podzapytanie zagnieżdżone SELECT znajduje się wewnątrz zewnętrznego zapytania SELECT, np. po klauzuli WHERE, HAVING lub FROM. W przypadku tego rodzaju zapytań w pierwszej kolejności wykonywane są wewnętrzne zapytania SELECT, a ich wynik jest wykorzystywany do zewnętrznego zapytania SELECT. Stąd łatwo zuważyć, że mogą one służyć do poprawy wydajności obsługi zapytania. Należy dobierać podzapytania tak by najbardziej zagnieżdżone podzapytanie zawierało najmniejszy zbiór poszukiwań. 

#### Przykład:
Jeżeli chcemy znaleźć w bazie informację o tytułach filmów zwróconych w zadanym okresie możemy wykonać następujące zapytanie:
```sql
SELECT
   film_id,
   title
FROM
   film
WHERE
   film_id IN (
      SELECT
         inventory.film_id
      FROM
         rental
      INNER JOIN inventory ON inventory.inventory_id = rental.inventory_id
      WHERE
         return_date BETWEEN '2005-05-29'
      AND '2005-05-30'
   );
```

#### Wynik
|film_id|title|
|-|-|
|307|Fellowship Autumn|
|255|Driving Polish|
|388|Gunfight Moon|
|130|Celebrity Horn|
|563|Massacre Usual|
|397|Hanky October|
|...|...|

### Używanie podzapytań

Pod zapytania mogą być używane w :
- SELECT,
- UPDATE,
- DELETE,
- Funkcjach agregujących,
- Do definiowania tabel tymczasowych.

Używając podzapytań zapytania SQL szybko mogą stać się mało czytelne. Przez co będą trudne w zrozumieniu i późniejszym utrzymaniu. W celu analizy zapytań można użyć klauzuli __EXPLAIN__, która przeanalizuje zapytanie. Klauzula ta może służyć również do porównywania wydajności zapytań

#### Przykład:
```sql
EXPLAIN SELECT
   *
FROM
   film
```

## Funkcje agregujące

Funkcje agregujące wykonują obliczenia na zestawie wierszy i zwracają pojedynczy wiersz. PostgreSQL udostępnia wszystkie standardowe funkcje agregujące SQL w następujący sposób:
- AVG () - zwraca średnią wartość.
- COUNT () - zwraca liczbę wartości.
- MAX () - zwraca maksymalną wartość.
- MIN () - zwraca minimalną wartość.
- SUM () - zwraca sumę wszystkich lub różnych wartości.

Pełna lista funkcji agregującej: https://www.postgresql.org/docs/9.5/functions-aggregate.html

Często używamy funkcji agregujących z klauzulą GROUP BY w instrukcji SELECT. W tych przypadkach klauzula GROUP BY dzieli zestaw wyników na grupy wierszy i funkcja agregująca wykonuje obliczenia dla każdej grupy, np. maksimum, minimum, średnia itp. Funkcji agregujących można używać funkcji agregujących jako wyrażeń tylko w następujących klauzulach: SELECT i HAVING.

### GROUP BY
Klauzula GROUP BY dzieli wiersze zwrócone z instrukcji SELECT na grupy. Dla  każdej grupy można zastosować funkcję agregującą, np. SUM aby obliczyć sumę pozycji lub
COUNT aby uzyskać liczbę elementów w grupach.

Poniższa instrukcja ilustruje składnię klauzuli GROUP BY:
```sql
SELECT 
    column_1, 
    aggregate_function(column_2)
FROM 
    tbl_name
GROUP BY 
    column_1;
```
Klauzula GROUP BY musi pojawić się zaraz po klauzuli FROM lub WHERE, n0astępnie GROUP BY zawiera listę  kolumna oddzielonych przecinkami. 

### HAVING
Często używamy klauzuli HAVING w połączeniu z klauzulą GROUP BY do filtrowania wierszy grup
które nie spełniają określonego warunku.

Poniższa instrukcja ilustruje typową składnię klauzuli HAVING:
```sql
SELECT
    column_1,
    aggregate_function (column_2)
FROM
    tbl_name
GROUP BY
    column_1
HAVING
    condition;
```
Klauzula HAVING ustawia warunek dla wierszy grup utworzonych przez klauzulę GROUP BY.  

Klauzula GROUP BY ma zastosowanie, podczas gdy klauzula WHERE określa wcześniej warunki dla poszczególnych wierszy.

## Zadania wprowadzające
Wykonaj zapytania przy użyciu DBMS:  
  
1. Znajdź listę wszystkich filmów o tej samej długości.
2. Znajdź wszystkich klientów mieszkających w tym samym mieście.
3. Oblicz średni koszt wypożyczenia wszystkich filmów.
4. Oblicz i wyświetl liczbę filmów we wszystkich kategoriach.
5. Wyświetl liczbę wszystkich klientów pogrupowanych według kraju.
6. Wyświetl informacje o sklepie, który ma więcej niż 100 klientów i mniej niż 300 klientów.
7. Wybierz wszystkich klientów, którzy oglądali filmy ponad 200 godzin.
8. Oblicz średnią wartość wypożyczenia filmu.
9. Oblicz średnią wartość długości filmu we wszystkich kategoriach.
10. Znajdź najdłuższe tytuły filmowe we wszystkich kategoriach.
11. Znajdź najdłuższy film we wszystkich kategoriach. Porównaj wynik z pkt 10.

Zad 1

In [21]:
length=46 #wybierz długość
zad1="SELECT * FROM film WHERE length= " + str(length) + " ORDER BY title "
pd.read_sql(zad1,con=connection)

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,last_update,special_features,fulltext
0,15,Alien Center,A Brilliant Drama of a Cat And a Mad Scientist...,2006,1,5,2.99,46,10.99,NC-17,2013-05-26 14:50:58.951,"[Trailers, Commentaries, Behind the Scenes]",'alien':1 'battl':15 'brilliant':4 'cat':8 'ce...
1,469,Iron Moon,A Fast-Paced Documentary of a Mad Cow And a Bo...,2006,1,7,4.99,46,27.99,PG,2013-05-26 14:50:58.951,"[Commentaries, Behind the Scenes]",'baloon':22 'boy':14 'cow':11 'dentist':19 'do...
2,504,Kwai Homeward,A Amazing Drama of a Car And a Squirrel who mu...,2006,1,5,0.99,46,25.99,PG-13,2013-05-26 14:50:58.951,"[Trailers, Commentaries]","'amaz':4 'car':8,16 'drama':5 'georgia':19 'ho..."
3,505,Labyrinth League,A Awe-Inspiring Saga of a Composer And a Frisb...,2006,1,6,2.99,46,24.99,PG-13,2013-05-26 14:50:58.951,"[Commentaries, Behind the Scenes]",'awe':5 'awe-inspir':4 'compos':10 'desert':22...
4,730,Ridgemont Submarine,A Unbelieveable Drama of a Waitress And a Comp...,2006,1,3,0.99,46,28.99,PG-13,2013-05-26 14:50:58.951,"[Commentaries, Deleted Scenes, Behind the Scenes]",'ancient':19 'compos':11 'cow':17 'drama':5 'j...

Zad 2

In [6]:
#od client from city
city="York"
zad2 = "SELECT city.city, customer.first_name, customer.last_name FROM customer INNER JOIN address USING (address_id) INNER JOIN city USING (city_id) WHERE customer.address_id IN ( SELECT address.address_id FROM address WHERE city_id IN ( SELECT city.city_id FROM city WHERE city = ('"+ city + "') ) ) ORDER BY customer.first_name, customer.last_name ASC "
pd.read_sql(zad2,con=connection)

   city first_name last_name
0  York    Gilbert    Sledge

Zad 3

In [7]:
zad3="SELECT AVG(rental_rate) FROM film"
pd.read_sql(zad3,con=connection)

    avg
0  2.98

Zad 4

In [9]:
#od number_films_in_category z usuniętym warunkiem where
zad4 = "SELECT category.name AS category, COUNT(film.title) FROM film INNER JOIN film_category ON film.film_id = film_category.film_id INNER JOIN category USING (category_id) GROUP BY category.name "
pd.read_sql(zad4,con=connection)

       category  count
0        Sports     74
1      Classics     57
2           New     63
3        Family     69
4        Comedy     58
5     Animation     66
6        Travel     57
7         Music     51
8         Drama     62
9        Horror     56
10       Sci-Fi     61
11        Games     61
12  Documentary     68
13      Foreign     73
14       Action     64
15     Children     60

Zad 5

In [11]:
#Client from city, z modyfikacją jak dodanym krajem
#zad5 = "SELECT country.country, city.city, customer.first_name, customer.last_name FROM customer INNER JOIN address USING (address_id) INNER JOIN city USING (city_id) INNER JOIN country USING (country_id) ORDER BY country.country, customer.first_name, customer.last_name ASC "
#zadanie wymaga liczby nie listy...
zad5 = "SELECT country.country, COUNT(country.country) FROM customer INNER JOIN address USING (address_id) INNER JOIN city USING (city_id) INNER JOIN country USING (country_id) GROUP BY country.country ORDER BY country.country ASC"
pd.read_sql(zad5,con=connection)

                                   country  count
0                              Afghanistan      1
1                                  Algeria      3
2                           American Samoa      1
3                                   Angola      2
4                                 Anguilla      1
5                                Argentina     13
6                                  Armenia      1
7                                  Austria      3
8                               Azerbaijan      2
9                                  Bahrain      1
10                              Bangladesh      3
11                                 Belarus      2
12                                 Bolivia      2
13                                  Brazil     28
14                                  Brunei      1
15                                Bulgaria      2
16                                Cambodia      2
17                                Cameroon      2
18                                  Canada      5
19                                    Chad      1
20                                   Chile      3
21                                   China     53
22                                Colombia      6
23   Congo, The Democratic Republic of the      2
24                          Czech Republic      1
25                      Dominican Republic      3
26                                 Ecuador      3
27                                   Egypt      6
28                                 Estonia      1
29                                Ethiopia      1
..                                     ...    ...
78                      Russian Federation     28
79        Saint Vincent and the Grenadines      1
80                            Saudi Arabia      5
81                                 Senegal      1
82                                Slovakia      1
83                            South Africa     11
84                             South Korea      5
85                                   Spain      5
86                               Sri Lanka      1
87                                   Sudan      2
88                                  Sweden      1
89                             Switzerland      3
90                                  Taiwan     10
91                                Tanzania      3
92                                Thailand      3
93                                   Tonga      1
94                                 Tunisia      1
95                                  Turkey     15
96                            Turkmenistan      1
97                                  Tuvalu      1
98                                 Ukraine      6
99                    United Arab Emirates      3
100                         United Kingdom      9
101                          United States     36
102                              Venezuela      7
103                                Vietnam      6
104                   Virgin Islands, U.S.      1
105                                  Yemen      4
106                             Yugoslavia      2
107                                 Zambia      1

[108 rows x 2 columns]

Zad 6

In [25]:
zad6 = "SELECT store.store_id, COUNT(customer.customer_id) FROM customer INNER JOIN store USING (store_id) GROUP BY store.store_id HAVING COUNT(customer.customer_id) > 100 AND COUNT(customer.customer_id) < 300"
pd.read_sql(zad6,con=connection)

   store_id  count
0         2    273

Zad 7

In [27]:
#Jeżeli jak długo oglądali filmy jest wzięte dosłownie (0 znalezionych wyników spełniających warunek)
#sum_min = 200*60
#zad7 ="SELECT customer.first_name, customer.last_name, SUM(film.length) FROM customer INNER JOIN rental USING (customer_id) INNER JOIN inventory USING (inventory_id) INNER JOIN film USING (film_id) GROUP BY customer.first_name, customer.last_name HAVING SUM(film.length) >= " + str(sum_min) + "ORDER BY SUM(film.length), customer.first_name, customer.last_name ASC "

#Jeżeli jak długo oglądali film oznacza czy kiedyś wypożyczali filmy przez dłużej niż 200 h...
zad7 ="SELECT customer.first_name, customer.last_name, MAX(rental.return_date-rental.rental_date) FROM customer INNER JOIN rental USING (customer_id) GROUP BY customer.first_name, customer.last_name HAVING MAX(rental.return_date-rental.rental_date) >= " + "('8 days 08:00:00')" + " ORDER BY customer.first_name, customer.last_name ASC "
pd.read_sql(zad7,con=connection)

    first_name    last_name             max
0        Aaron        Selby 9 days 00:36:00
1         Adam        Gooch 8 days 23:50:00
2       Adrian        Clary 8 days 20:35:00
3        Agnes       Bishop 9 days 05:19:00
4         Alan         Kahn 9 days 01:12:00
5       Albert       Crouse 9 days 04:50:00
6         Alex      Gresham 9 days 05:27:00
7    Alexander      Fennell 9 days 02:54:00
8       Alfred     Casillas 9 days 03:11:00
9      Alfredo      Mcadams 9 days 02:51:00
10       Alice      Stewart 9 days 04:09:00
11       Allan      Cornish 9 days 02:11:00
12       Allen  Butterfield 8 days 21:12:00
13     Allison      Stanley 9 days 01:53:00
14        Alma       Austin 9 days 05:43:00
15       Alvin      Deloach 8 days 21:04:00
16      Amanda       Carter 9 days 05:05:00
17       Amber        Dixon 9 days 02:32:00
18         Amy        Lopez 8 days 19:47:00
19         Ana      Bradley 9 days 04:28:00
20       Andre         Rapp 9 days 05:38:00
21      Andrea    Henderson 9 days 01:15:00
22      Andrew        Purdy 9 days 05:54:00
23        Andy      Vanhorn 9 days 02:33:00
24       Angel      Barclay 9 days 02:20:00
25      Angela    Hernandez 9 days 03:23:00
26       Anita      Morales 9 days 04:11:00
27         Ann        Evans 8 days 20:14:00
28        Anna         Hill 8 days 23:10:00
29     Annette        Olson 9 days 04:36:00
..         ...          ...             ...
536    Vanessa         Sims 9 days 04:00:00
537      Velma        Lucas 9 days 02:36:00
538       Vera        Mccoy 9 days 05:58:00
539     Vernon        Chapa 9 days 00:37:00
540   Veronica        Stone 9 days 03:49:00
541      Vicki       Fields 9 days 05:17:00
542     Vickie       Brewer 8 days 23:07:00
543     Victor      Barkley 9 days 03:41:00
544   Victoria       Gibson 9 days 04:24:00
545    Vincent      Ralston 9 days 04:40:00
546      Viola       Hanson 9 days 05:44:00
547     Violet    Rodriquez 9 days 03:10:00
548     Virgil      Wofford 9 days 03:59:00
549   Virginia        Green 9 days 04:17:00
550     Vivian         Ruiz 9 days 03:17:00
551       Wade     Delvalle 9 days 04:49:00
552    Wallace        Slone 8 days 23:05:00
553     Walter     Perryman 9 days 04:57:00
554      Wanda    Patterson 9 days 05:11:00
555     Warren      Sherrod 9 days 02:57:00
556      Wayne       Truong 9 days 01:38:00
557      Wendy     Harrison 9 days 05:47:00
558     Wesley         Bull 9 days 05:28:00
559    Willard      Lumpkin 8 days 20:53:00
560    William  Satterfield 9 days 05:52:00
561     Willie       Howell 9 days 05:49:00
562     Willie      Markham 9 days 03:44:00
563      Wilma     Richards 9 days 04:05:00
564    Yolanda       Weaver 9 days 05:25:00
565    Zachary         Hite 8 days 23:51:00

[566 rows x 3 columns]

Zad 8

In [16]:
#lekka modyfikacja zad 3
zad8="SELECT AVG(amount) FROM payment"
pd.read_sql(zad8,con=connection)
#Wynik jest większy niż z zad 3, widocznie w bazie danych są częściej wypożyczene droższe filmy

        avg
0  4.200606

Zad 9

In [15]:
#lekka modyfikacja zad 4 AVG zamiast count
zad9 = "SELECT category.name AS category, AVG(film.length) FROM film INNER JOIN film_category ON film.film_id = film_category.film_id INNER JOIN category USING (category_id) GROUP BY category.name "
pd.read_sql(zad9,con=connection)

       category         avg
0        Sports  128.202703
1      Classics  111.666667
2           New  111.126984
3        Family  114.782609
4        Comedy  115.827586
5     Animation  111.015152
6        Travel  113.315789
7         Music  113.647059
8         Drama  120.838710
9        Horror  112.482143
10       Sci-Fi  108.196721
11        Games  127.836066
12  Documentary  108.750000
13      Foreign  121.698630
14       Action  111.609375
15     Children  109.800000

Zad 10

In [20]:
#lekka modyfikacja zad 10 MAX LEN title zamiast count
zad10 = "SELECT category.name AS category, MAX(LENGTH(film.title)) FROM film INNER JOIN film_category ON film.film_id = film_category.film_id INNER JOIN category USING (category_id) GROUP BY category.name "
pd.read_sql(zad10,con=connection)

       category  max
0        Sports   25
1      Classics   23
2           New   21
3        Family   22
4        Comedy   23
5     Animation   22
6        Travel   23
7         Music   22
8         Drama   22
9        Horror   27
10       Sci-Fi   20
11        Games   21
12  Documentary   22
13      Foreign   20
14       Action   23
15     Children   20

Zad 11

In [17]:
#lekka modyfikacja zad 4 MAX length zamiast count
zad11 = "SELECT category.name AS category, MAX(film.length) FROM film INNER JOIN film_category ON film.film_id = film_category.film_id INNER JOIN category USING (category_id) GROUP BY category.name "
pd.read_sql(zad11,con=connection)

       category  max
0        Sports  184
1      Classics  184
2           New  183
3        Family  184
4        Comedy  185
5     Animation  185
6        Travel  185
7         Music  185
8         Drama  181
9        Horror  181
10       Sci-Fi  185
11        Games  185
12  Documentary  183
13      Foreign  184
14       Action  185
15     Children  178

## Zadanie implementacyjne
Zaimplementuj wszystkie funkcje w pliku main.py zgodnie z opisem a następnie przetestuj je w notatniku.

Screenshot od testów z test_main znajduje się w tym samym folderze, co ten raport, poniższe przykłady pokazują, jak funkcje działają w notatniku po importowaniu main'a

In [1]:
import main

In [3]:
main.film_in_category(1)

                      title              language category
0              Amadeus Holy  English                Action
1           American Circus  English                Action
2        Antitrust Tomatoes  English                Action
3             Ark Ridgemont  English                Action
4       Barefoot Manchurian  English                Action
5              Berets Agent  English                Action
6            Bride Intrigue  English                Action
7            Bull Shawshank  English                Action
8           Caddyshack Jedi  English                Action
9           Campus Remember  English                Action
10        Casualties Encino  English                Action
11           Celebrity Horn  English                Action
12          Clueless Bucket  English                Action
13              Crow Grease  English                Action
14              Dances None  English                Action
15             Darko Dorado  English                Action
16           Darn Forrester  English                Action
17             Devil Desire  English                Action
18             Dragon Squad  English                Action
19             Dream Pickup  English                Action
20     Drifter Commandments  English                Action
21           Easy Gladiator  English                Action
22  Entrapment Satisfaction  English                Action
23           Excitement Eve  English                Action
24         Fantasy Troopers  English                Action
25        Firehouse Vietnam  English                Action
26         Fool Mockingbird  English                Action
27             Forrest Sons  English                Action
28              Glass Dying  English                Action
29           Gosford Donnie  English                Action
..                      ...                   ...      ...
34            Lawrence Love  English                Action
35             Lord Arizona  English                Action
36                Lust Lock  English                Action
37       Magnolia Forrester  English                Action
38        Midnight Westward  English                Action
39             Minds Truman  English                Action
40    Mockingbird Hollywood  English                Action
41        Montezuma Command  English                Action
42             Park Citizen  English                Action
43            Patriot Roman  English                Action
44            Primary Glass  English                Action
45          Quest Mussolini  English                Action
46             Rear Trading  English                Action
47      Rings Heartbreakers  English                Action
48      Rugrats Shakespeare  English                Action
49            Shrunk Divine  English                Action
50                 Side Ark  English                Action
51              Sky Miracle  English                Action
52               South Wait  English                Action
53           Speakeasy Date  English                Action
54    Stagecoach Armageddon  English                Action
55               Story Side  English                Action
56          Suspects Quills  English                Action
57              Trip Newton  English                Action
58             Truman Crazy  English                Action
59          Uprising Uptown  English                Action
60   Waterfront Deliverance  English                Action
61            Werewolf Lola  English                Action
62             Women Dorado  English                Action
63             Worst Banger  English                Action

[64 rows x 3 columns]

In [6]:
a=main.film_in_category(155) #ma być pusta odpowiedź
type(a)

NoneType

In [14]:
main.number_films_in_category(1)

  category  count
0   Action     64

In [15]:
main.number_films_in_category(155) #ma być pusta odpowiedź

In [16]:
main.number_film_by_length(46,56)

    length  count
0       46      5
1       47      7
2       48     11
3       49      5
4       50      9
5       51      7
6       52      7
7       53      9
8       54      6
9       55      2
10      56      5

In [17]:
main.number_film_by_length(45,45) #ma być pusta odpowiedź

In [19]:
main.client_from_city("Athenai")

      city first_name last_name
0  Athenai      Linda  Williams

In [20]:
main.client_from_city("Lethbridge") #ma być pusta odpowiedź

In [21]:
main.avg_amount_by_length(46)

   length       avg
0      46  3.638352

In [22]:
main.avg_amount_by_length(45) #ma być pusta odpowiedź

In [25]:
main.client_by_sum_length(1265)

    first_name    last_name   sum
0        Brian        Wyman  1265
1      Antonio         Meek  1451
2        Leona       Obrien  1588
3    Katherine       Rivera  1615
4      Tiffany       Jordan  1667
5       Jerome       Kenyon  1679
6        Penny         Neal  1738
7       Lonnie       Tirado  1834
8       Dwight     Lombardi  1846
9       Johnny       Turpin  1846
10    Caroline       Bowman  1847
11       Allan      Cornish  1916
12       Lewis        Lyman  1933
13      Lester        Kraus  1943
14         Eva        Ramos  1945
15      Austin      Cintron  1961
16       Joann      Gardner  1963
17       Annie      Russell  1965
18    Jonathan  Scarborough  1984
19       Anita      Morales  1999
20      Eileen         Carr  2031
21     Kenneth       Gooden  2033
22       Wayne       Truong  2044
23       Floyd        Gandy  2063
24       Paula       Bryant  2084
25      Nellie      Garrett  2098
26     Vanessa         Sims  2103
27          Jo       Fowler  2107
28       Ruben        Geary  2107
29      Nelson  Christenson  2119
..         ...          ...   ...
569     Marsha      Douglas  4154
570   Michelle        Clark  4157
571    Brandon         Huey  4160
572      Naomi     Jennings  4164
573      Brett     Cornwell  4197
574      Steve    Mackenzie  4206
575      Harry         Arce  4222
576     Warren      Sherrod  4233
577     Martha     Gonzalez  4237
578       June      Carroll  4261
579     Curtis         Irby  4280
580     Rhonda      Kennedy  4307
581        Sue       Peters  4319
582      Louis        Leone  4333
583     Angela    Hernandez  4362
584     Janice         Ward  4366
585      Daisy        Bates  4369
586        Tim         Cary  4476
587      Diane      Collins  4514
588  Elizabeth        Brown  4531
589     Justin          Ngo  4550
590     Sherry     Marshall  4582
591     Marion       Snyder  4599
592    Russell      Brinson  4640
593     Marcia         Dean  4734
594      Clara         Shaw  4808
595     Wesley         Bull  4808
596      Tammy      Sanders  5065
597    Eleanor         Hunt  5360
598       Karl         Seal  5388

[599 rows x 3 columns]

In [24]:
main.client_by_sum_length(5389)#ma być pusta odpowiedź

In [26]:
main.category_statistic_length("Action")

  category         avg   sum  min  max
0   Action  111.609375  7143   47  185

In [28]:
main.category_statistic_length("Cartoon") #ma być pusta odpowiedź